'''
订单分配初始化数据
'''
def init_data():
    # 初始化数据
    M = 7
    B = 3
    d = [183, 202, 217, 240, 125, 330, 261,
         183, 202, 217, 240, 125, 330, 261,
         183, 202, 217, 240, 125, 330, 261]  # 供应商与顾客的距离 改   读取数据库格式：读取数据库格式：按照AK排，每个订单 d 都一样
    P = [230, 240, 210, 220, 240, 220, 230,
         180, 200, 190, 170, 150, 170, 160,
         180, 200, 190, 170, 150, 170, 160]  # 单价p    1*8   改   读取数据库格式：按照AK排，
    t = [136 * 3, 112 * 3, 111 * 3]  # 订单     B1的总工时数  改
    yunfei = 5  # 单位距离配送价格
    amin = [0] * M * B
    amax = [100 * 100, 100 * 100, 90 * 100, 90 * 100, 130 * 100, 120 * 100, 130 * 100,
            120 * 100, 160 * 100, 150 * 100, 100 * 100, 90 * 100, 110 * 100, 100 * 100,
            120 * 100, 160 * 100, 150 * 100, 100 * 100, 90 * 100, 110 * 100, 100 * 100]  # 改   读取数据库格式：100\200  之后再乘以100
    Co = [5 * 24]  # 需要增加时间条件
    Pir = [1, 2, 3]  # 需要增加优先级，工序
    mean_v = 90
    return M, B, d, P, t, yunfei, amin, amax ,Co ,Pir ,mean_v
